{"config": {"layers": [{"config": {"batch_input_shape": [null, 10], "sparse": false, "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "name": "dense_3", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "name": "dense_4", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "keras_version": "2.0.8", "class_name": "Model", "backend": "tensorflow"}